# Import Libraries

In [7]:
import pymysql
import pandas as pd
from sqlalchemy import create_engine

## Create Engine

In [8]:
#create sqlalchemy engine
engine = create_engine('mysql+pymysql://{user}:{pw}@localhost/{db}'.format(user='root',pw='password',db='world_x'))

## Read Table

In [9]:
df = pd.read_sql_table('city',engine)

In [10]:
df.head()

   ID            Name CountryCode       District                     Info
0   1           Kabul         AFG          Kabol  {'Population': 1780000}
1   2        Qandahar         AFG       Qandahar   {'Population': 237500}
2   3           Herat         AFG          Herat   {'Population': 186800}
3   4  Mazar-e-Sharif         AFG          Balkh   {'Population': 127800}
4   5       Amsterdam         NLD  Noord-Holland   {'Population': 731200}

## Read Query

In [11]:
query = '''SELECT * FROM country'''

In [14]:
df2 = pd.read_sql_query(query,engine)

In [15]:
df2.head()

  Code         Name  Capital Code2
0  ABW        Aruba    129.0    AW
1  AFG  Afghanistan      1.0    AF
2  AGO       Angola     56.0    AO
3  AIA     Anguilla     62.0    AI
4  ALB      Albania     34.0    AL

## Read SQL

In [16]:
# Convinience wrapper for read_sql_query & read_sql_table
df3 = pd.read_sql('city',con=engine)

In [17]:
df3.tail()

        ID        Name CountryCode    District                    Info
4074  4075  Khan Yunis         PSE  Khan Yunis  {'Population': 123175}
4075  4076      Hebron         PSE      Hebron  {'Population': 119401}
4076  4077    Jabaliya         PSE  North Gaza  {'Population': 113901}
4077  4078      Nablus         PSE      Nablus  {'Population': 100231}
4078  4079       Rafah         PSE       Rafah   {'Population': 92020}

In [21]:
query2 = '''SELECT * FROM countrylanguage'''

In [22]:
df4 = pd.read_sql(query2, con=engine)

In [23]:
df4.tail()

    CountryCode Language IsOfficial  Percentage
979         ZMB   Tongan          F        11.0
980         ZWE  English          T         2.2
981         ZWE  Ndebele          F        16.2
982         ZWE   Nyanja          F         2.2
983         ZWE    Shona          F        72.1

## Joining

In [24]:
query3 = '''SELECT c.Code, c.Name, cl.Language, IsOfficial
            FROM country c
            LEFT JOIN countrylanguage cl
            ON c.Code = cl.CountryCode
            WHERE c.Code = 'NGA'
            '''

In [25]:
df5 = pd.read_sql(query3, engine)

In [27]:
df5

  Code     Name Language IsOfficial
0  NGA  Nigeria     Bura          F
1  NGA  Nigeria      Edo          F
2  NGA  Nigeria      Ful          F
3  NGA  Nigeria    Hausa          F
4  NGA  Nigeria   Ibibio          F
5  NGA  Nigeria      Ibo          F
6  NGA  Nigeria      Ijo          F
7  NGA  Nigeria   Joruba          F
8  NGA  Nigeria   Kanuri          F
9  NGA  Nigeria      Tiv          F

In [28]:
df5['Language'].unique()

array(['Bura', 'Edo', 'Ful', 'Hausa', 'Ibibio', 'Ibo', 'Ijo', 'Joruba',
       'Kanuri', 'Tiv'], dtype=object)

In [29]:
languages = df5['Language'].unique()

In [30]:
print('There are unique {} languages in this dataframe'.format(len(languages)))

There are unique 10 languages in this dataframe

## Save to SQL

In [31]:
df5.to_sql('nigerian_languages', engine, if_exists='fail')